// Пользователь вводит n.
// Вывести сумму n членов последовательности 1.2 - 1.4 + 1.6 - 1.8 ...
#include <stdio.h>

int main(void)
{
    size_t n;
    double res = 0.0, sign = 1.0, el = 1.2;

    printf("Введите n: ");
    scanf("%zu", &n);

    for (size_t i = 0; i < n; i++)
    {
        printf("%+.6lf\n", sign * el);
        res += sign * el;
        sign *= -1.0;
        el += 0.2;
    }

    printf("Сумма %zu членов последовательности = %.6lf\n", n, res);
}

// $ ./04-example2.out 
// Введите n: 8
// +1.200000
// -1.400000
// +1.600000
// -1.800000
// +2.000000
// -2.200000
// +2.400000
// -2.600000
// Сумма 8 членов последовательности = -0.800000
